#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
data.aws_secretsmanager_secret.github_token: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_availability_zones.available: Reading...
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240819195525719600000001]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_security_group.gtw_lb: Refreshing state... [id=sg-0ddc9f6d8fb60802e]
aws_lb_target_group.gtw_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0]
aws_lb_target_group.bff_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0f505df8b5227d2be]
aws_lb.gtw_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1504e27b1a9387be]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_lb.bff_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/5aa868ff550d2701]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_lb_listener.gtw_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/1504e27b1a9387be/8e7e051be87c920e]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/5aa868ff550d2701/ce2ba0c83e75b924]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
data.aws_elasticache_replication_group.redis_cluster: Reading...
data.aws_elasticache_replication_group.redis_cluster: Read complete after 0s [id=my-redis-cluster]
aws_ecs_task_definition.gtw_service_app: Refreshing state... [id=gtw-service-app-task]
aws_ecs_task_definition.bff_service_app: Refreshing state... [id=bff-service-app-task]
aws_ecs_service.bff_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service]
aws_ecs_service.gtw_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_codebuild_project.application_build will be destroyed
  # (because aws_codebuild_project.application_build is not in configuration)
  - resource "aws_codebuild_project" "application_build" {
      - arn                    = "arn:aws:codebuild:eu-west-1:802288441694:project/application-build" -> null
      - badge_enabled          = false -> null
      - build_timeout          = 60 -> null
      - concurrent_build_limit = 0 -> null
      - encryption_key         = "arn:aws:kms:eu-west-1:802288441694:alias/aws/s3" -> null
      - id                     = "arn:aws:codebuild:eu-west-1:802288441694:project/application-build" -> null
      - name                   = "application-build" -> null
      - project_visibility     = "PRIVATE" -> null
      - queued_timeout         = 480 -> null
      - service_role           = "arn:aws:iam::802288441694:role/codebuild-service-role" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null

      - artifacts {
          - encryption_disabled    = false -> null
          - location               = "my-build-artifacts-bucket-asics" -> null
          - name                   = "application-build" -> null
          - namespace_type         = "NONE" -> null
          - override_artifact_name = false -> null
          - packaging              = "ZIP" -> null
          - type                   = "S3" -> null
        }

      - cache {
          - modes = [] -> null
          - type  = "NO_CACHE" -> null
        }

      - environment {
          - compute_type                = "BUILD_GENERAL1_SMALL" -> null
          - image                       = "aws/codebuild/standard:4.0" -> null
          - image_pull_credentials_type = "CODEBUILD" -> null
          - privileged_mode             = false -> null
          - type                        = "LINUX_CONTAINER" -> null
        }

      - logs_config {
          - cloudwatch_logs {
              - status = "ENABLED" -> null
            }
          - s3_logs {
              - encryption_disabled = false -> null
              - status              = "DISABLED" -> null
            }
        }

      - source {
          - buildspec           = "buildspec.yml" -> null
          - git_clone_depth     = 1 -> null
          - insecure_ssl        = false -> null
          - location            = "https://github.com/mandicm223/example-gh-code-pipeline" -> null
          - report_build_status = false -> null
          - type                = "GITHUB" -> null
        }
    }

  # aws_codebuild_project.build_project will be created
  + resource "aws_codebuild_project" "build_project" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = (known after apply)
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "bff-codebuild-project"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = (known after apply)
      + tags_all             = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + cache {
          + type = "LOCAL"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:4.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "AWS_DEFAULT_REGION"
              + type  = "PLAINTEXT"
              + value = "eu-west-1"
            }
        }

      + source {
          + buildspec = "buildspec.yml"
          + type      = "CODEPIPELINE"
        }
    }

  # aws_codebuild_source_credential.github_credential will be destroyed
  # (because aws_codebuild_source_credential.github_credential is not in configuration)
  - resource "aws_codebuild_source_credential" "github_credential" {
      - arn         = "arn:aws:codebuild:eu-west-1:802288441694:token/github" -> null
      - auth_type   = "PERSONAL_ACCESS_TOKEN" -> null
      - id          = "arn:aws:codebuild:eu-west-1:802288441694:token/github" -> null
      - server_type = "GITHUB" -> null
      - token       = (sensitive value) -> null
    }

  # aws_codepipeline.codepipeline will be created
  + resource "aws_codepipeline" "codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "github-to-aws-pipeline"
      + role_arn = (known after apply)
      + tags_all = (known after apply)

      + artifact_store {
          + location = "my-build-artifacts-bucket-asics"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "Branch"     = "main"
                  + "OAuthToken" = (sensitive value)
                  + "Owner"      = "mandicm223"
                  + "Repo"       = "https://github.com/mandicm223/example-gh-code-pipeline"
                }
              + name             = "Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "ThirdParty"
              + provider         = "GitHub"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "bff-codebuild-project"
                }
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "Build"
              + output_artifacts = [
                  + "build_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
    }

  # aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codebuild_service_role will be destroyed
  # (because aws_iam_role.codebuild_service_role is not in configuration)
  - resource "aws_iam_role" "codebuild_service_role" {
      - arn                   = "arn:aws:iam::802288441694:role/codebuild-service-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-15T12:14:18Z" -> null
      - force_detach_policies = false -> null
      - id                    = "codebuild-service-role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "codebuild-service-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2024-08-15T12:30:51Z"
              - region         = "eu-west-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPPHJR2WALM" -> null

      - inline_policy {
          - name   = "terraform-20240815121418521100000001" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:*",
                              - "logs:*",
                              - "cloudwatch:*",
                              - "secretsmanager:GetSecretValue",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codedeploy_service_role will be destroyed
  # (because aws_iam_role.codedeploy_service_role is not in configuration)
  - resource "aws_iam_role" "codedeploy_service_role" {
      - arn                   = "arn:aws:iam::802288441694:role/codedeploy-service-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-15T12:14:18Z" -> null
      - force_detach_policies = false -> null
      - id                    = "codedeploy-service-role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "codedeploy-service-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2024-08-19T08:29:22Z"
              - region         = "eu-west-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPOU7UARE2G" -> null

      - inline_policy {
          - name   = "terraform-20240815121418543900000002" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:*",
                              - "ec2:*",
                              - "lambda:*",
                              - "autoscaling:*",
                              - "sns:*",
                              - "cloudwatch:*",
                              - "ecs:DescribeServices",
                              - "ecs:UpdateService",
                              - "ecs:CreateTaskSet",
                              - "ecs:DeleteTaskSet",
                              - "ecs:DescribeTaskSets",
                              - "ecs:DescribeTasks",
                              - "elasticloadbalancing:DescribeTargetGroups",
                              - "elasticloadbalancing:DescribeTargetHealth",
                              - "elasticloadbalancing:RegisterTargets",
                              - "elasticloadbalancing:DeregisterTargets",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.codebuild_service_role_policy will be destroyed
  # (because aws_iam_role_policy.codebuild_service_role_policy is not in configuration)
  - resource "aws_iam_role_policy" "codebuild_service_role_policy" {
      - id     = "codebuild-service-role:terraform-20240815121418521100000001" -> null
      - name   = "terraform-20240815121418521100000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                          - "logs:*",
                          - "cloudwatch:*",
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "codebuild-service-role" -> null
    }

  # aws_iam_role_policy.codedeploy_service_role_policy will be destroyed
  # (because aws_iam_role_policy.codedeploy_service_role_policy is not in configuration)
  - resource "aws_iam_role_policy" "codedeploy_service_role_policy" {
      - id     = "codedeploy-service-role:terraform-20240815121418543900000002" -> null
      - name   = "terraform-20240815121418543900000002" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                          - "ec2:*",
                          - "lambda:*",
                          - "autoscaling:*",
                          - "sns:*",
                          - "cloudwatch:*",
                          - "ecs:DescribeServices",
                          - "ecs:UpdateService",
                          - "ecs:CreateTaskSet",
                          - "ecs:DeleteTaskSet",
                          - "ecs:DescribeTaskSets",
                          - "ecs:DescribeTasks",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "codedeploy-service-role" -> null
    }

  # aws_iam_role_policy_attachment.codebuild_attach will be created
  + resource "aws_iam_role_policy_attachment" "codebuild_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeBuildDeveloperAccess"
      + role       = "codebuild-role"
    }

  # aws_iam_role_policy_attachment.codedeploy_attach will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "codedeploy-role"
    }

  # aws_iam_role_policy_attachment.codepipeline_attach will be created
  + resource "aws_iam_role_policy_attachment" "codepipeline_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodePipelineFullAccess"
      + role       = "codepipeline-role"
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-06e777883e1f5464b"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0f505df8b5227d2be"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 6 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with aws_codepipeline.codepipeline,
  on code-pipeline.tf line 16, in resource "aws_codepipeline" "codepipeline":
  16:       provider         = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*